Портал_EDT/src/InformationRegisters/Аук_ДанныеШапокПодведенияИтогов/Аук_ДанныеШапокПодведенияИтогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аук_ДанныеШапокПодведенияИтогов</name>
  <resources>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.УБД_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аукцион</name>
    <type>
      <types>CatalogRef.Аук_Аукционы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Портал_EDT/src/InformationRegisters/Аук_ДанныеШапокПодведенияИтогов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	Если Не пСтруктураЗаписи.Свойство("Автор") Тогда
		
	КонецЕсли;	
	
	сткРез =  Аук_ОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "Аук_ДанныеШапокПодведенияИтогов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;	
	
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат Аук_ОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "Аук_ДанныеШапокПодведенияИтогов");
	
КонецФункции	

Функция ТекущиеДанныеШапкиПодведенияИтоговАукциона(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ДанныеШапокПодведенияИтогов.ОбщаяСумма КАК ОбщаяСумма,
	|	Аук_ДанныеШапокПодведенияИтогов.ОбщийСрок КАК ОбщийСрок
	|ИЗ
	|	РегистрСведений.Аук_ДанныеШапокПодведенияИтогов КАК Аук_ДанныеШапокПодведенияИтогов
	|ГДЕ
	|	Аук_ДанныеШапокПодведенияИтогов.Аукцион = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции	

Функция СтруктураЗаписи() Экспорт

	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Аукцион",		);
	сткРезультат.Вставить("ОбщаяСумма",		);
	сткРезультат.Вставить("ОбщийСрок",		);
	сткРезультат.Вставить("Автор",			?(ЗначениеЗаполнено(ПараметрыСеанса.глТекПользователь),
												ПараметрыСеанса.глТекПользователь,
												ПредопределенноеЗначение("Справочник.УБД_Пользователи.Система")));
												
	сткРезультат.Вставить("ДатаЗаписи",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	
	Возврат сткРезультат;
	
КонецФункции	

#КонецОбласти
